package com.company;
/*          Створити вказану у завданнях ієрархію класів. Створити поліморфні об’єкти. Під час
        виконання програми виводити справжній тип поліморфних об’єктів.
        В реалізації за допомогою абстрактних класів всі спільні поля мають бути описані у
        абстрактному класі.

        Варіант 5
            Створити базовий клас – список. Реалізувати на базі списку стек і чергу з
        віртуальними функціями добавлення та вилучення елементів. Для перевірки визначити масив
        вказівників на базовий клас, яким присвоюються адреси різних об’єктів.*/
public class Main {

    public static void main(String[] args) {


    }
}
